Revit 2027 API
BarTypeDiameterOptions Properties
The BarTypeDiameterOptions type exposes the following members.
Properties
Name | Description
BarMassPerUnitLength |  Represents the bar mass per unit length of the RebarBarType.
BarModelDiameter |  Represents the bar model diameter of the RebarBarType.
BarNominalDiameter |  Represents the bar nominal diameter of the RebarBarType.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
StandardBendDiameter |  Represents the standard bar bend diameter of the RebarBarType.
StandardHookBendDiameter |  Represents the standard hook bend diameter of the RebarBarType.
StirrupTieBendDiameter |  Represents the stirrup/tie bar and hook bend diameter of the RebarBarType.
Top
See Also
Reference
BarTypeDiameterOptions Class
Autodesk.Revit.DB Namespace